socialNetwork/wrk2/test-run/COMMAND_5/15
Running 1m test @ http://localhost:31111/wrk2-api/home-timeline/read
  8 threads and 16 connections
  Thread calibration: mean lat.: 0.763ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.700ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.696ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.745ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.746ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.668ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.672ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.668ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   722.53us  355.15us   1.32ms   96.19%
    Req/Sec   263.68     74.04   444.00     87.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  688.00us
 75.000%  804.00us
 90.000%    0.94ms
 99.000%    1.32ms
 99.900%    3.18ms
 99.990%    7.39ms
 99.999%   39.42ms
100.000%   42.88ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.087     0.000000            1         1.00
       0.523     0.100000        10137         1.11
       0.569     0.200000        20136         1.25
       0.610     0.300000        30214         1.43
       0.649     0.400000        40131         1.67
       0.688     0.500000        50189         2.00
       0.708     0.550000        55134         2.22
       0.729     0.600000        60061         2.50
       0.752     0.650000        65087         2.86
       0.776     0.700000        70021         3.33
       0.804     0.750000        75129         4.00
       0.819     0.775000        77523         4.44
       0.836     0.800000        80054         5.00
       0.856     0.825000        82591         5.71
       0.878     0.850000        85017         6.67
       0.904     0.875000        87525         8.00
       0.918     0.887500        88775         8.89
       0.935     0.900000        90050        10.00
       0.954     0.912500        91288        11.43
       0.976     0.925000        92522        13.33
       1.003     0.937500        93791        16.00
       1.018     0.943750        94369        17.78
       1.036     0.950000        95016        20.00
       1.056     0.956250        95641        22.86
       1.079     0.962500        96246        26.67
       1.109     0.968750        96880        32.00
       1.130     0.971875        97179        35.56
       1.152     0.975000        97498        40.00
       1.174     0.978125        97814        45.71
       1.199     0.981250        98118        53.33
       1.230     0.984375        98429        64.00
       1.249     0.985938        98589        71.11
       1.275     0.987500        98751        80.00
       1.298     0.989062        98901        91.43
       1.339     0.990625        99056       106.67
       1.386     0.992188        99211       128.00
       1.413     0.992969        99288       142.22
       1.453     0.993750        99367       160.00
       1.493     0.994531        99448       182.86
       1.546     0.995313        99523       213.33
       1.618     0.996094        99601       256.00
       1.672     0.996484        99640       284.44
       1.742     0.996875        99679       320.00
       1.819     0.997266        99718       365.71
       1.933     0.997656        99757       426.67
       2.059     0.998047        99796       512.00
       2.155     0.998242        99816       568.89
       2.245     0.998437        99835       640.00
       2.501     0.998633        99855       731.43
       2.753     0.998828        99874       853.33
       3.307     0.999023        99894      1024.00
       3.511     0.999121        99904      1137.78
       3.927     0.999219        99913      1280.00
       4.335     0.999316        99923      1462.86
       4.695     0.999414        99933      1706.67
       5.107     0.999512        99943      2048.00
       5.247     0.999561        99948      2275.56
       5.383     0.999609        99952      2560.00
       5.595     0.999658        99957      2925.71
       5.847     0.999707        99962      3413.33
       6.051     0.999756        99967      4096.00
       6.579     0.999780        99970      4551.11
       6.663     0.999805        99972      5120.00
       6.743     0.999829        99974      5851.43
       6.799     0.999854        99977      6826.67
       6.867     0.999878        99979      8192.00
       7.387     0.999890        99981      9102.22
       9.823     0.999902        99982     10240.00
      11.991     0.999915        99983     11702.86
      17.199     0.999927        99984     13653.33
      19.823     0.999939        99985     16384.00
      24.303     0.999945        99986     18204.44
      27.327     0.999951        99987     20480.00
      27.327     0.999957        99987     23405.71
      31.263     0.999963        99988     27306.67
      31.263     0.999969        99988     32768.00
      35.711     0.999973        99989     36408.89
      35.711     0.999976        99989     40960.00
      35.711     0.999979        99989     46811.43
      39.423     0.999982        99990     54613.33
      39.423     0.999985        99990     65536.00
      39.423     0.999986        99990     72817.78
      39.423     0.999988        99990     81920.00
      39.423     0.999989        99990     93622.86
      42.879     0.999991        99991    109226.67
      42.879     1.000000        99991          inf
#[Mean    =        0.723, StdDeviation   =        0.355]
#[Max     =       42.848, Total count    =        99991]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119990 requests in 1.00m, 22.77MB read
Requests/sec:   1999.82
Transfer/sec:    388.64KB